// Задача 19
// Напишите программу, которая принимает на вход пятизначное число и проверяет, 
// является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

int number = FromStringToInt("Введите число: ");
int length = (Console.ReadLine());


int ReverseNumber(int number);

    int numberStart = number / 10;
    int numberEnd = number % 10;

while (iEnd>iStart)
{
    iEnd = iEnd - 1;
    iStart = iStart + 1;
    break;
}

return number

int FromStringToInt(string message)
{
    System.Console.Write(message);
    string value = Console.ReadLine();
    int result1 = Convert.ToInt32(value);
    return result1;
}

    

