// Задача 20: Напишите программу, которая
// принимает на вход координаты двух точек и
// находит расстояние между ними в 2D
// пространстве.
// A (3,6); B (2,1) -> 5,09
// A (7,-5); B (1,-1) -> 7,21

double d = Math.Sqrt(5);
double num = 5.099874453;
double dRound = Math.Round(num, 2, MidpointRounding.ToZero);
System.Console.WriteLine(dRound);